app/Http/Controllers/OrderController.php

select * from `customers` where 0 = 1 and `customers`.`deleted_at` is null
select * from `order_details` where `order_details`.`order_id` in ('1bdfbbbf-bdbb-4f1b-bce8-58bf36ead2f4', 'da216dce-380d-4640-9052-eeae18b10752', 'f558537d-3c2b-427b-9b9a-6db26689149b') and `order_details`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where `order_details`.`deleted_at` is null
select count(*) as aggregate from `orders` where date(`created_at`) = '2024-08-07' and `orders`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where date(`created_at`) = '2024-08-07' and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where date(`created_at`) = '2024-08-07' and `order_details`.`deleted_at` is null
select count(*) as aggregate from `orders` where month(`created_at`) = '08' and year(`created_at`) = '2024' and `orders`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where month(`created_at`) = '08' and year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where month(`created_at`) = '08' and year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
select count(*) as aggregate from `orders` where year(`created_at`) = '2024' and `orders`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
---
    public function index(Request $request): View
    {
        $orders = Order::with('customer', 'order_details')->search(trim($request->search_query))->latest()->paginate(10);

        $totalCost = OrderDetail::sum('total_cost');
        $totalSold = OrderDetail::sum('total');
        $totalProfile = $totalSold - $totalCost;

        $todayQuery = OrderDetail::whereDate('created_at', Carbon::today());
        $totalOrdersToday = Order::whereDate('created_at', Carbon::today())->count();
        $totalCostToday = $todayQuery->sum('total_cost');
        $totalSoldToday = $todayQuery->sum('total');
        $totalProfileToday = $totalSoldToday - $totalCostToday;


        $thisMonthQuery = OrderDetail::whereMonth('created_at', date('m'))->whereYear('created_at', date('Y'));
        $totalOrdersThisMonth =  Order::whereMonth('created_at', date('m'))->whereYear('created_at', date('Y'))->count();


        $totalCostThisMonth = $thisMonthQuery->sum('total_cost');
        $totalSoldThisMonth = $thisMonthQuery->sum('total');
        $totalProfileThisMonth = $totalSoldThisMonth - $totalCostThisMonth;

        $thisYearQuery = OrderDetail::whereYear('created_at', date('Y'));
        $totalOrdersThisYear =  Order::whereYear('created_at', date('Y'))->count();


        $totalCostThisYear = $thisYearQuery->sum('total_cost');
        $totalSoldThisYear = $thisYearQuery->sum('total');

select * from `customers` where 0 = 1 and `customers`.`deleted_at` is null
select * from `order_details` where `order_details`.`order_id` in ('f558537d-3c2b-427b-9b9a-6db26689149b') and `order_details`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where `deleted_at` is not null and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where `deleted_at` is not null and `order_details`.`deleted_at` is null
select count(*) as aggregate from `orders` where `deleted_at` is not null and date(`created_at`) = '2024-08-07' and `orders`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where `deleted_at` is not null and date(`created_at`) = '2024-08-07' and `order_details`.`deleted_at` is null
select * from `order_details` where `order_details`.`order_id` in ('1bdfbbbf-bdbb-4f1b-bce8-58bf36ead2f4') and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where `deleted_at` is not null and date(`created_at`) = '2024-08-07' and `order_details`.`deleted_at` is null
select count(*) as aggregate from `orders` where `deleted_at` is not null and month(`created_at`) = '08' and year(`created_at`) = '2024' and `orders`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where `deleted_at` is not null and month(`created_at`) = '08' and year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
select * from `order_details` where `order_details`.`order_id` in ('76c8f482-b4d7-4d5e-8f96-4fe0c2c5647f') and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where `deleted_at` is not null and month(`created_at`) = '08' and year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
select count(*) as aggregate from `orders` where `deleted_at` is not null and year(`created_at`) = '2024' and `orders`.`deleted_at` is null
select sum(`total_cost`) as aggregate from `order_details` where `deleted_at` is not null and year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
select sum(`total`) as aggregate from `order_details` where `deleted_at` is not null and year(`created_at`) = '2024' and `order_details`.`deleted_at` is null
---
    public function deleted(Request $request): View
    {
        $orders = Order::with('customer', 'order_details')
            ->onlyTrashed()->search(trim($request->search_query))->latest()->paginate(10);

        $totalCost = OrderDetail::onlyTrashed()->sum('total_cost');
        $totalSold = OrderDetail::onlyTrashed()->sum('total');
        $totalProfile = $totalSold - $totalCost;

        $todayQuery = OrderDetail::onlyTrashed()->whereDate('created_at', Carbon::today());
        $totalOrdersToday = Order::onlyTrashed()->whereDate('created_at', Carbon::today())->count();
        $totalCostToday = $todayQuery->sum('total_cost');
        $totalSoldToday = $todayQuery->sum('total');
        $totalProfileToday = $totalSoldToday - $totalCostToday;


        $thisMonthQuery = OrderDetail::onlyTrashed()->whereMonth('created_at', date('m'))->whereYear('created_at', date('Y'));
        $totalOrdersThisMonth =  Order::onlyTrashed()->whereMonth('created_at', date('m'))->whereYear('created_at', date('Y'))->count();


        $totalCostThisMonth = $thisMonthQuery->sum('total_cost');
        $totalSoldThisMonth = $thisMonthQuery->sum('total');
        $totalProfileThisMonth = $totalSoldThisMonth - $totalCostThisMonth;

        $thisYearQuery = OrderDetail::onlyTrashed()->whereYear('created_at', date('Y'));
        $totalOrdersThisYear =  Order::onlyTrashed()->whereYear('created_at', date('Y'))->count();


        $totalCostThisYear = $thisYearQuery->sum('total_cost');
        $totalSoldThisYear = $thisYearQuery->sum('total');

select * from `customers` where 0 = 1 and `customers`.`deleted_at` is null
select * from `order_details` where `order_details`.`order_id` in ('20f7ba44-0aa4-48ee-b9e6-d835c6ac2269') and `order_details`.`deleted_at` is null
select * from `orders` where `orders`.`id` = 'f558537d-3c2b-427b-9b9a-6db26689149b' and `orders`.`deleted_at` is null limit 1
---
    public function show(string $id): View
    {
        $order = Order::withTrashed()->with('customer', 'order_details')->findOrFail($id);

select * from `customers` where 0 = 1 and `customers`.`deleted_at` is null
select * from `order_details` where `order_details`.`order_id` in ('f558537d-3c2b-427b-9b9a-6db26689149b') and `order_details`.`deleted_at` is null
select * from `orders` where `orders`.`id` = 'f558537d-3c2b-427b-9b9a-6db26689149b' limit 1
---
    public function deletedShow(string $id): View
    {
        $order = Order::withTrashed()->with('customer', 'order_details')->findOrFail($id);

select DATE_FORMAT(created_at, "%M %Y") as date, SUM(total) as total, max(created_at) as createdAt from `order_details` where `order_details`.`deleted_at` is null group by `date` order by createdAt asc limit 12
select DATE_FORMAT(created_at, "%M %Y") as date, count(*) as total, max(created_at) as createdAt from `orders` where `orders`.`deleted_at` is null group by `date` order by createdAt asc limit 12
select DATE_FORMAT(created_at, "%M %Y") as date, SUM(total_cost) as total, max(created_at) as createdAt from `order_details` where `order_details`.`deleted_at` is null group by `date` order by createdAt asc limit 12
---
    public function showAnalytics(): View
    {

        $totalPerMonth = OrderDetail::select(
            DB::raw('DATE_FORMAT(created_at, "%M %Y") as date'),
            DB::raw('SUM(total) as total'),
            DB::raw('max(created_at) as createdAt')
        )->groupBy('date')
            ->orderBy(DB::raw("createdAt"), 'ASC')->take(12)->get()->each(function ($order) {
                $order->setAppends(['display_total']);
            });



        $totalOrdersPerMonth = Order::select(
            DB::raw('DATE_FORMAT(created_at, "%M %Y") as date'),
            DB::raw('count(*) as total'),
            DB::raw('max(created_at) as createdAt')
        )->groupBy('date')
            ->orderBy(DB::raw("createdAt"), 'ASC')->take(12)->get()->each(function ($order) {
                $order->setAppends([]);
            });

        $totalProfitMonth = OrderDetail::select(
            DB::raw('DATE_FORMAT(created_at, "%M %Y") as date'),
            DB::raw('SUM(total) - SUM(total_cost) as total'),
            DB::raw('max(created_at) as createdAt')
        )->groupBy('date')
            ->orderBy(DB::raw("createdAt"), 'ASC')->take(12)->get()->each(function ($order) {
                $order->setAppends([]);
            });

update `orders` set `paid_status` = 'UNPAID', `eat_status` = 'Eat Out', `orders`.`updated_at` = '2024-08-07 10:49:38' where `id` = '20f7ba44-0aa4-48ee-b9e6-d835c6ac2269'
update `order_details` set `deleted_at` = '2024-08-07 10:49:38', `order_details`.`updated_at` = '2024-08-07 10:49:38' where `order_details`.`order_id` = '20f7ba44-0aa4-48ee-b9e6-d835c6ac2269' and `order_details`.`order_id` is not null and `order_details`.`deleted_at` is null
select * from `sold_items` where `order_id` = '20f7ba44-0aa4-48ee-b9e6-d835c6ac2269'
---
        $order->eat_status = $request->eat_status;
        $order->paid_status = $request->paid_status;

        $order->save();
        $order->order_details()->delete();

        $soldItems = SoldItem::where('order_id', $order->id)->get();

insert into `orders` (`number`, `subtotal`, `delivery_charge`, `discount`, `total`, `tender_amount`, `change`, `tax_rate`, `remarks`, `table_name`, `table_status`, `user_id`, `id`, `updated_at`, `created_at`) values ('2487075420', 810000, '0', 0, 810000, 810000, 0, '0', '', 'tes tabel', 'pending', '82da6c32-366b-4095-a5e5-0933b7833a0f', 'da216dce-380d-4640-9052-eeae18b10752', '2024-08-07 07:20:54', '2024-08-07 07:20:54')
insert into `order_details` (`quantity`, `product_name`, `product_image_url`, `price`, `cost`, `total`, `total_cost`, `created_at`, `order_id`, `id`, `updated_at`) values (1, 'Caesar Salad', 'https://the-bruvs.wmktech.net/img/item-image/zKv9rOk15haxcJUG1Zpm4dYhVip7QIbub9qbU4OO.jpg?w=512&h=512&fit=crop', 405000, 148500, 405000, 148500, '2024-08-07 10:49:14', '20f7ba44-0aa4-48ee-b9e6-d835c6ac2269', 'ec5e6ccc-a98e-4fc6-8ff6-09e57a4ce9d7', '2024-08-07 10:49:38')
insert into `orders` (`number`, `subtotal`, `delivery_charge`, `discount`, `total`, `tender_amount`, `change`, `tax_rate`, `remarks`, `table_name`, `table_status`, `user_id`, `eat_status`, `paid_status`, `id`, `updated_at`, `created_at`) values ('2487072447', 720000, '0', 0, 720000, 720000, 0, '0', '', 'tes tabel', 'pending', '82da6c32-366b-4095-a5e5-0933b7833a0f', 'Eat Out', 'PAID', '1bdfbbbf-bdbb-4f1b-bce8-58bf36ead2f4', '2024-08-07 07:47:24', '2024-08-07 07:47:24')
---
            $order_detail->cost = $product->cost;
            $order_detail->total = $quantity * $product->price;
            $order_detail->total_cost = $quantity * $product->cost;
            $order_detail->created_at = $order->created_at;
            //$order_detail->product()->associate($product);
            $order_detail->order()->associate($order);
            $order_detail->save();

insert into `orders` (`number`, `subtotal`, `delivery_charge`, `discount`, `total`, `tender_amount`, `change`, `tax_rate`, `remarks`, `table_name`, `table_status`, `user_id`, `eat_status`, `paid_status`, `id`, `updated_at`, `created_at`) values ('2487101449', 405000, '0', 0, 405000, 405000, 0, '0', '', 'table 2', 'pending', '82da6c32-366b-4095-a5e5-0933b7833a0f', 'Eat In', 'PAID', '20f7ba44-0aa4-48ee-b9e6-d835c6ac2269', '2024-08-07 10:49:14', '2024-08-07 10:49:14')
---
        $order->eat_status = $request->eat_status;
        $order->paid_status = $request->paid_status;

        $order->save();

insert into `order_details` (`quantity`, `product_name`, `product_image_url`, `price`, `cost`, `total`, `total_cost`, `created_at`, `order_id`, `id`, `updated_at`) values (1, 'Caesar Salad', 'https://the-bruvs.wmktech.net/img/item-image/zKv9rOk15haxcJUG1Zpm4dYhVip7QIbub9qbU4OO.jpg?w=512&h=512&fit=crop', 405000, 148500, 405000, 148500, '2024-08-07 10:49:14', '20f7ba44-0aa4-48ee-b9e6-d835c6ac2269', 'adef8e66-d75a-45e0-b83f-ff8cb0d5bc4d', '2024-08-07 10:49:14')
---
            $order_detail->created_at = $order->created_at;
            //$order_detail->product()->associate($product);
            $order_detail->order()->associate($order);
            $order_detail->save();